app/controllers/comments_controller.rb

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    @idea = Idea.find(params[:idea_id])
    @comment = Comment.find(params[:id])

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "idea_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "New Comment"], ["user_id", 1], ["idea_id", 2], ["created_at", "2020-08-15 16:31:08.647983"], ["updated_at", "2020-08-15 16:31:08.647983"]]
---
  def create
    @idea = Idea.find(params[:idea_id])
    @comment = Comment.where(idea_id: @idea.id).new(comment_params)
    @comment.user = @current_user

    if @comment.save

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 4]]
---
  def destroy
    @idea = Idea.find(params[:idea_id])
    @comment = Comment.find(params[:id])
    @comment.destroy