app/controllers/ideas_controller.rb

  def index
    @ideas = Idea.all
---
SELECT "ideas".* FROM "ideas"

  def create
    @idea = Idea.new(idea_params)

    if @idea.save
---
INSERT INTO "ideas" ("title", "date", "notes", "img_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @idea.update(idea_params)
---
UPDATE "ideas" SET "img_url" = $1, "updated_at" = $2 WHERE "ideas"."id" = $3  [["img_url", "https://images.unsplash.com/photo-1571330735066-03aaa9429d89?ixlib=rb-1.2.1&auto=format&fit=crop&w=1050&q=80"], ["updated_at", "2020-08-13 19:18:40.799492"], ["id", 2]]

  def destroy
    @idea.destroy
---
DELETE FROM "ideas" WHERE "ideas"."id" = $1  [["id", 4]]

    def set_idea
      @idea = Idea.find(params[:id])
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]